// import React, { useEffect, useContext } from 'react';
import { useNavigate } from 'react-router-dom';
import { useForm } from "react-hook-form";
// import { AppContext } from "../App";

function About() {
    return(<>
        <h2>גמ"ח שמלות ארועים נווה יעקב ירושלים</h2>
        <p>הגמ"ח מתעדכן כל הזמן ומביא את הדגמים העדכניים והחדישים ביותר!<br/><b>כ80 שמלות בכל סט!</b></p>
        <p>להזמנת תור חייגו 03-3065480 מענה אנושי בטל' 1-800-55-20-20 שלוחה 8<br/>gsmalot@gmail.com</p>
        <p>תקנון ונהלים:
אין אפשרות לבטל הזמנה או לבצע שינויים במייל.

ההגעה לגמ"ח:

כתובת הגמ"ח: רחוב צוקרמן 1 , מאחורי המדרגות מרח' פרדס צמוד  לבית כנסת 'בית תפילה'. קווי אוטובוס: 59,69, 85,25. יש לרדת בתחנה: פרדס צוקרמן (בכיוון השני פרדס גולאק ולחצות את הכביש) ולרדת במדרגות.

אין להביא בשום פנים ואופן תינוקים, עגלות, בנים, וילדות שאינן זקוקות למדידה!

אין כניסה לגברים!

 לבקשת השכנים אין להחנות את רכביכם בסמיכות לגמ"ח ולבנינים אפילו לזמן קצר. ניתן לחנות במפלס העליון שבכניסה לרחוב .

  בכדי להזמין שמלות בגמ"ח יש לקבוע תור בטלפון שמספרו: 03-3065480.


 מענה אנושי, לשאלות קצרות ודחופות בלבד, בטל' 1800552020 שלוחה 8, לאחר ההודעה המוקלטת, 
ביום א' בין 9:00-10:30 בבוקר ובימים ב' ג' ד 'ה' בין 21:00-22:30
 

 בגמ"ח ישנם סטים רבים של שמלות אירועים לילדות, נערות ונשים(עד מידה 52). מדובר בסטים עדכניים וגדולים עד 100 שמלות בסט.


הזמנת השמלות:

התשלום עבור שכירות שמלה, לכסוי חלקי של ההוצאות, הוא 50 ₪ לשמלת ילדות, ו-100 ₪ לשמלת נערות.

התשלום בשעת הרישום, יש להצטייד בתשלום מראש.

הזמנת השמלות  מתבצעת בהגעה לגמ"ח, עם תשלום מלא וחתימה על נהלי הגמ"ח. אין אפשרות להזמין במייל.

ביטול הזמנה – בהתראה של שבועיים מראש - תחויב בתשלום של 20 ₪ לשמלת ילדות, ו-30 ₪ לשמלת נערות.
ביטול הזמנה תתבצע בהתראה של שבועיים מראש. ביטול פחות משבועיים לפני האירוע יחוייב במחיר 50%.
החלפת דגם - כביטול שמלה.


קבלת השמלות:

       קבלת השמלות - יומיים לפני החתונה.
       יש להצטייד בפרטי אשראי לצורך פיקדון.

    בעת קבלת השמלות, מוטלת עליכם האחריות לוודא שאכן קיבלתם בדיוק מה שהזמנתם.


החזרת השמלות:

     אין לכבס את השמלות.

      את השמלות צריך להחזיר לגמ"ח יום למחרת החתונה עד השעה 13:00.
     איחור בהחזרת השמלות, יגרור חיוב עלות השכרה נוספת, עבור כל שמלה לכל יום.
    
   נא לבדוק שהחזרתם הכל. כולל אביזרים ואריזות.


תיקונים:

      אין לבצע שום תיקונים בשמלות ללא קבלת רשות מפורשת ונקודתית מההנהלה.

      גם במקרה שקיבלתם רשות לבצע תיקון, זאת אך ורק בתנאי שהשמלה תוחזר למצבה הקודם מבלי שישארו עקבות.

       תיקון שלא יוחזר לגמרי לקדמותו כראוי - יגבה עבורו דמי התיקון, בתוספת 100 ש"ח דמי טיפול!!!

   עם זאת – יש להחזיר את השמלות בזמן.

 יש לשמור על השמלות, ובמידה ונגרם נזק – לשאת בכל ההוצאות וההפסדים הישירים והעקיפים שנגרמו לגמ"ח.</p>
        <h3>דרכי הגעה:</h3>
        <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3389.2926398087297!2d35.24511695812035!3d31.84425110043901!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x15032a58c18df151%3A0xf931c6d2c527d657!2z15HXqNeV15og16bXlden16jXntefLCDXmdeo15XXqdec15nXnQ!5e0!3m2!1siw!2sil!4v1716902537182!5m2!1siw!2sil" 
         style={{height:450 ,width:600,  border:0}} allowFullScreen="" loading="lazy" referrerPolicy="no-referrer-when-downgrade"></iframe>
    </>)
}

export default About